R1>en
R1#conf t
R1(config)#ip route 172.31.0.0 255.255.255.0 172.31.1.193
R1(config)#ip route 172.31.1.196 255.255.255.252 172.31.1.193
R1(config)#ip route 172.31.1.128 255.255.255.192 172.31.1.193

R2>en 
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#ip route 172.31.1.0 255.255.255.128 se 0/0/0
%Default route without gateway, if not a point-to-point interface, may impact performance
R2(config)#ip route 172.31.1.128 255.255.255.192 se 0/0/1
%Default route without gateway, if not a point-to-point interface, may impact performance
R2(config)#

R3>en
R3#conf t
R3(config)#ip route 0.0.0.0 ?
R3(config) #ip route 0.0.0.0 0.0.0.0 ger
R3 (config) #ip route 0.0.0.0 0.0.0.0 serial 0/0/1
Default route without gateway, if not a point-to-point interface, may impact performance